# Tugmalar
button-song-download = 🎵 Скачать песню из видео
button-yt-video = 🎞 Видео
button-yt-audio = 🎧 Аудио
button-back = 🔙 Назад
button-delete = 🗑 Удалить
button-add = ➕ Добавить
button-admins = 👮‍♂ Администраторы
button-send-message = 📨 Отправить сообщение
button-stat = 📊 Статистика
button-branchs = 🏪 Филиалы
button-branch_type_man = 🧑‍💼 Мужчины
button-branch_type_woman = 💄 Женщины
button-branch_type_child = 🧒 Дети
button-yes = 🟢 Да
button-no = 🔴 Нет
button-send_location = 📍 Отправить местоположение

# Matnlar
text-ican = 🎉 Здравствуйте!

    Я официальный бот магазина одежды "Vip Brand" – ваш помощник в получении информации о наших филиалах! 😊

    💡 Мои возможности:
    🏬 Филиалы: Чтобы получить полную информацию о наших филиалах, просто напишите /filiall.

    🏬 Вы можете узнать адрес филиалов, номер телефона, ссылку на Instagram, а также время открытия и закрытия.

    Отправьте команду /filiall, чтобы быстро и легко получить нужную информацию – я готов помочь вам! 🚀

    Наслаждайтесь ботом "Vip Brand" и, если возникнут вопросы, пишите в @vakhabovs_contactbot. 😊


text-processing-link = Ссылка обрабатывается ⏳...
text-invalide-link = Пожалуйста, отправьте действительную ссылку на Instagram или YouTube. Если возникнут проблемы с работой бота, свяжитесь с @vakhabovs_contactBot.
text-successfully-set-language = Язык успешно изменен на узбекский! 🇺🇿
text-error-download = Не удалось скачать контент. Проверьте ссылку или попробуйте позже. Если возникнут проблемы с работой бота, свяжитесь с @vakhabovs_contactBot.
text-canceled = Отменено
text-admin-welcome = Добро пожаловать, Админ!
text-admin-home = Главное меню
text-get_message-for_admin_tg_id = Введите Telegram ID для предоставления прав администратора:
    Для отмены введите /cancel.
text-get_message-for_admin_name = Введите имя:
    Для отмены введите /cancel.
text-admin-deleted = Администратор успешно удален.
text-invalide-tg_id = Неверное значение, попробуйте снова:
    Для отмены введите /cancel.
text-successfully-added-admin = Успешно добавлено!
text-tg_id = Telegram ID
text-get_message-for_send = Отправьте сообщение для рассылки:
    Для отмены введите /cancel.
text-processing-broadcasting = Началась рассылка сообщений.
    Общее количество пользователей: { $count }
text-finish-broadcasting = Рассылка сообщений завершена.
    { $count } пользователей получили сообщение.
text-no_users = Пользователи отсутствуют!
text-stat = Статистика 📨
    👥 Общее количество пользователей: { $total }
    📌 Пользователи, добавленные сегодня: { $today }
    📌 Пользователи, добавленные на этой неделе: { $week }
    📌 Пользователи, добавленные в этом месяце: { $month }
text-successfully-load_token = Файл токена загружен
text-send-token_file = Отправьте файл с токеном
text-post-caption = @DigiDownloaderBot - бот для скачивания из Instagram и YouTube!
text-branch-get_location = Отправьте местоположение филиала:
text-branch-home = Меню филиалов
text-branch-list = Список филиалов типа { $branch_type }:
text-branch-no_branches_type = Филиалы типа { $branch_type } не найдены
text-branch-get_name = Введите название филиала:
text-branch-get_phone = Введите номер телефона:
text-branch-successfully_added = Филиал успешно добавлен!
text-branch-not_found = Филиал не найден
text-branch-location = Местоположение филиала { $name }:
text-branch-get_name_ru = Пожалуйста, введите название филиала на русском:
text-branch-get_instagram_choice = Есть ли у нового филиала профиль в Instagram?
text-branch-get_instagram_link = Введите ссылку на профиль Instagram:
text-branch-get_hours = Пожалуйста, введите время открытия и закрытия филиала (например, 09:00-18:00):
text-branch-save_error = Ошибка при сохранении филиала.
text-branch-deleted = Филиал (ID: { $branch_id }) успешно удален!
text-branch-get_address = Введите адрес филиала: